[
{"genus":"Ribes","species":"silvestre","common_name":"red currant","family":"Grossulariaceae","zones":"[3]","light":"fd","moisture":"m","form_size":"m","form":"Shrub","min_h":3.0,"max_h":5.0,"min_w":3.0,"max_w":5.0, "description": "Red currant (Ribes silvestre) is a versatile shrub that can be a great addition to a garden for its tangy, edible berries and its ecological benefits. It thrives in well-drained, acidic to neutral soils and prefers cooler, temperate climates. Red currants produce clusters of bright red, tart berries that are excellent for making jams, jellies, and sauces. They are also known for their high vitamin C content. This shrub can grow in both sunny and partially shaded areas, making it adaptable to various garden conditions. Additionally, red currants are relatively easy to propagate from cuttings. \nHowever, there are a few considerations before planting. Red currants can be susceptible to powdery mildew and leaf spot diseases, so proper spacing and airflow are essential. While they do not fix nitrogen, they can attract pollinators like bees and butterflies, which can benefit other plants in the garden. They have a moderate growth rate and can be harvested once the berries turn a deep red, typically in mid-summer. Proper storage involves refrigerating the fresh berries or freezing them for longer preservation. Their ability to adapt to different light conditions and their beneficial crops make red currants a standout choice for gardeners looking to add both edible and ecological value to their space."},
{"genus":"Corylus","species":"avellana","common_name":"European filbert","family":"Corylaceae","zones":"[4]","light":"f","moisture":"m","form_size":"vl","form":"Shrub","min_h":12.0,"max_h":25.0,"min_w":25.0,"max_w":25.0, "description": "The European hazelnut (Corylus avellana) is a valuable addition to any garden, especially for those interested in growing their own edible nuts. This hardy shrub thrives in well-drained, slightly acidic to neutral soils and prefers full sun to partial shade. It's renowned for its delicious, high-protein nuts, which are great for snacking or cooking. Harvest typically occurs in late summer to early autumn, with nuts that can be stored for several months if kept in a cool, dry place. \nThis plant is also beneficial for its ecological role. European hazelnuts attract pollinators like bees with their early spring catkins, which can enhance the productivity of nearby crops. Additionally, its dense foliage provides good cover for wildlife. However, it’s important to note that hazelnuts can be susceptible to diseases like hazelnut blight (Apiozus scutellatus) and pests such as the hazelnut weevil (Curculio nucum), so some management may be necessary. For propagation, hazelnuts can be grown from seeds or through suckers, making it relatively easy to expand your planting. Overall, its combination of edible nuts and ecological benefits makes it a standout choice for a diverse garden."},
{"genus":"Echinacea","species":"purpurea","common_name":"purple coneflower","family":"Asteraceae","zones":"[3, 4, 5, 6, 7, 8]","light":"fd","moisture":"m","form_size":"I","form":"Herb","min_h":3.0,"max_h":4.0,"min_w":12.0,"max_w":12.0, "description": "Purple coneflower (Echinacea purpurea) is a standout addition to any garden, prized for its striking, daisy-like flowers and medicinal properties. This perennial thrives in well-drained soils, preferring a neutral to slightly acidic pH, and is well-suited to sunny spots. It's known for its potential health benefits, particularly its immune-boosting properties; the roots and flowers are often used in herbal remedies. The plant is also beneficial for pollinators, attracting bees, butterflies, and hummingbirds, which makes it an excellent choice for supporting a vibrant garden ecosystem. \nHowever, purple coneflower does have a few drawbacks. It can be susceptible to fungal diseases like powdery mildew, particularly in humid conditions, and may require spacing to prevent overcrowding. It prefers dry to moderately moist conditions and can struggle in heavy, wet soils. Propagation is straightforward through seeds or division of established clumps. While it's not a fast grower, its resilience and ability to thrive in less-than-ideal conditions make it a valuable and attractive option for garden enthusiasts."},
{"genus":"Symphytum","species":"officinale","common_name":"comfrey","family":"Boraginaceae","zones":"[4]","light":"fd","moisture":"m","form_size":"l","form":"Herb","min_h":3.0,"max_h":5.0,"min_w":3.0,"max_w":5.0, "description": "Comfrey (Symphytum officinale) is a versatile and useful plant for garden enthusiasts. Known for its rapid growth and robust nature, it thrives in a variety of soil conditions, from neutral to slightly alkaline, and can tolerate both lowland and upland environments. Comfrey's standout feature is its deep taproot, which mines nutrients from the soil and accumulates them in its lush foliage. This makes it an excellent choice for adding valuable nutrients to compost or as a mulch, enhancing soil health for neighboring plants. The plant also attracts beneficial insects like bees and butterflies, making it a valuable asset in a pollinator-friendly garden. \nHowever, there are some considerations before planting comfrey. Its vigorous growth can be invasive, potentially spreading beyond its intended area if not managed properly. Additionally, while the leaves are rich in potassium and can be used to make a nutrient-rich liquid fertilizer, comfrey’s roots are not typically harvested for food or medicinal use due to their high alkaloid content, which can be toxic if consumed in large quantities. Propagation is straightforward, as comfrey readily spreads through root cuttings or division. Despite these drawbacks, its ability to support soil fertility and attract pollinators makes comfrey a noteworthy addition to diverse garden settings."},
{"genus":"Monarda","species":"didyma","common_name":"bee balm","family":"Lamiaceae","zones":"[4, 5, 6, 7, 8, 9]","light":"fd","moisture":"m","form_size":"l","form":"Herb","min_h":3.0,"max_h":4.0,"min_w":2.0,"max_w":6.0, "description": "Bee balm (Monarda didyma) is a vibrant, aromatic herb worth considering for its culinary and ecological benefits. Known for its striking red blooms and strong fragrance, bee balm thrives in full sun to partial shade and prefers well-drained, slightly acidic to neutral soil. It attracts a variety of pollinators, including bees, butterflies, and hummingbirds, making it a valuable addition to gardens aiming to support local wildlife. The plant's leaves and flowers are edible and can be used in teas, salads, and as a culinary herb, while its medicinal properties include antimicrobial and soothing effects. \nHowever, bee balm can be prone to powdery mildew, especially in humid climates or overcrowded conditions, so proper spacing and airflow are crucial. The plant grows quickly and can spread aggressively, which might be a drawback if not managed properly. For propagation, bee balm can be easily grown from seeds or divided in early spring. Its versatility and ability to attract beneficial insects make it a standout choice for enhancing garden biodiversity and adding a splash of color."},
{"genus":"Diospyros","species":"virginiana","common_name":"American persimmon","family":"Ebenaceae","zones":"[5, 6, 7, 8, 9]","light":"f","moisture":"xm","form_size":"l","form":"Tree","min_h":50.0,"max_h":75.0,"min_w":35.0,"max_w":50.0, "description": "The American persimmon (Diospyros virginiana) is a compelling choice for gardeners interested in unique fruit and ecological benefits. This deciduous tree thrives in a variety of soil types, from acidic to neutral, and prefers well-drained soils in full sun to partial shade. It is celebrated for its sweet, orange fruit, which is a valuable crop in late fall when it ripens after frost. These fruits can be eaten fresh, dried, or used in baking, and their unique flavor makes them a standout in the garden. The tree's foliage also contributes to the ecosystem by supporting pollinators like bees and butterflies. \nHowever, it's important to note that American persimmon has some drawbacks. The fruit requires another tree for cross-pollination to ensure good yields, so planting multiple trees is necessary. Additionally, the tree is sensitive to extreme cold and can suffer from issues like persimmon leaf spot, though it generally has few other serious pest problems. The American persimmon is relatively slow-growing, so patience is needed for full fruit production. Despite these challenges, its distinctive fruit, adaptability to various soils, and ecological benefits make it a notable addition to any garden."},
{"genus":"Asimina","species":"triloba","common_name":"pawpaw","family":"Annonaceae","zones":"[5, 6, 7]","light":"fds","moisture":"m","form_size":"s-m","form":"Tree","min_h":20.0,"max_h":35.0,"min_w":20.0,"max_w":35.0, "description": "The pawpaw (Asimina triloba) is a unique choice for gardeners looking for an unconventional fruit. Native to the eastern United States, it thrives in rich, well-drained soils with a slightly acidic to neutral pH. This small tree or large shrub prefers partial shade to full sun and is well-suited to the understory of woodland gardens or forested areas. The pawpaw stands out for its large, tropical-flavored fruits, which are rich in vitamins and have a custard-like texture. Harvesting occurs in late summer to early fall, but the fruits are delicate and should be consumed fresh or frozen for longer storage. \nOne drawback is that pawpaws require cross-pollination from another tree for fruit set, so planting multiple trees is necessary. Additionally, they can be susceptible to pests like the pawpaw webworm and diseases such as pawpaw anthracnose. Despite these issues, their fast growth rate and the exotic flavor of their fruit make them a standout addition to any garden. Propagation is typically done through seeds or grafting, with seeds needing stratification to germinate. Pawpaws also attract specific pollinators like beetles, which are drawn to their large, fleshy flowers."},
{"genus":"Astragalus","species":"glycyphylios","common_name":"milk vetch","family":"Fabaceae","zones":"[4, 5, 6, 7, 8]","light":"f","moisture":"xm","form_size":"s","form":"Herb","min_h":8.0,"max_h":1.0,"min_w":3.0,"max_w":5.0, "description": "This herbaceous perennial is valued for its ability to fix nitrogen in the soil, which can enhance soil fertility and support nearby plants. It thrives in well-drained soils and prefers slightly alkaline conditions, making it suitable for a variety of garden settings. Milk vetch can grow in sunny to partially shaded areas, and its robust root system helps it tolerate dry conditions once established. Its fast growth rate can quickly cover ground, providing valuable ground cover and preventing erosion. \nIn terms of crops, milk vetch produces small, edible pods that can be used in cooking or medicine, though they are less commonly harvested compared to other legumes. One potential drawback is that it may attract certain pests like aphids or scale insects, which can affect its health and productivity. For propagation, milk vetch can be grown from seeds sown directly in the soil or started indoors. Its ability to improve soil health and support other plants makes it a valuable addition to diverse planting schemes, though its specific needs and susceptibility to pests should be considered when planning its placement."},
{"genus":"Castanea","species":"mollissima","common_name":"Chinese chestnut","family":"Fagaceae","zones":"[5]","light":"f","moisture":"xm","form_size":"m","form":"Tree","min_h":25.0,"max_h":35.0,"min_w":25.0,"max_w":35.0, "description": "The Chinese chestnut (Castanea mollissima) is an excellent choice for forest gardens due to its productive and versatile nature. This tree thrives in well-drained, slightly acidic to neutral soils and prefers full sun to partial shade. It's particularly valued for its sweet, large nuts, which are a great source of food for both humans and wildlife. The tree is also adaptable to a range of environments, from lowland areas to uplands, and can handle periods of drought once established. In addition to its nut production, the Chinese chestnut contributes to soil structure with its deep, fibrous root system, which can help stabilize soil and prevent erosion. \nHowever, potential drawbacks include its susceptibility to chestnut blight (Cryphonectaria parasitica), which has historically been a significant issue for chestnut species. Proper management practices and selecting resistant cultivars can mitigate these concerns. Additionally, Chinese chestnuts require cross-pollination with another chestnut tree to set fruit, so planting multiple trees is necessary for good nut yields. Despite these challenges, its benefits—such as its excellent nut quality and adaptability—make it a standout choice for those looking to diversify their forest garden or orchard."},
{"genus":"Caragana","species":"arborescens","common_name":"Siberian pea shrub","family":"Fabaceae","zones":"[2, 3, 4, 5, 6, 7]","light":"f","moisture":"xm","form_size":"l-vl","form":"Shrub","min_h":8.0,"max_h":20.0,"min_w":12.0,"max_w":18.0},
{"genus":"Mentha","species":"x piperita","common_name":"peppermint","family":"Lamiaceae","zones":"[3, 4, 5, 6, 7, 8, 9, 10]","light":"fd","moisture":"mh","form_size":"m","form":"Herb","min_h":1.0,"max_h":2.0,"min_w":0.0,"max_w":0.0},
{"genus":"Ribes","species":"nigrum","common_name":"black currant","family":"Grossulariaceae","zones":"[4]","light":"fd","moisture":"m","form_size":"m","form":"Shrub","min_h":3.0,"max_h":5.0,"min_w":3.0,"max_w":5.0},
{"genus":"Zanthoxylum","species":"piperitum","common_name":"Japanese pepper tree","family":"Rutaceae","zones":"[7]","light":"fd","moisture":"m","form_size":"m","form":"Shrub","min_h":6.0,"max_h":6.0,"min_w":6.0,"max_w":6.0},
{"genus":"Pyrus","species":"bretschneideris","common_name":"Asian pear","family":"Rosaceae","zones":"[4, 5, 6, 7, 8, 9]","light":"f","moisture":"m","form_size":"m","form":"Tree","min_h":25.0,"max_h":30.0,"min_w":25.0,"max_w":25.0},
{"genus":"Juglans","species":"cinerea","common_name":"butternut","family":"Juglandaceae","zones":"[3]","light":"f","moisture":"m","form_size":"l","form":"Tree","min_h":50.0,"max_h":75.0,"min_w":50.0,"max_w":75.0},
{"genus":"Crambe","species":"maritima","common_name":"sea kale","family":"Brassicaceae","zones":"[4, 5, 6, 7, 8]","light":"fd","moisture":"xm","form_size":"ra","form":"Herb","min_h":2.0,"max_h":3.0,"min_w":3.0,"max_w":3.0}
]

